api/app/Repository/ItemsProductRepository.php

SELECT COALESCE(COUNT(*), 0) AS total_produk
FROM `db_items`
WHERE `company_id` = '4'
AND `status` = 1
 LIMIT 1
---
    public function total_produk(string $company_id)
    {
        try {
            $this->itemsProductModels->select("COALESCE(COUNT(*),0) AS total_produk");
            $this->itemsProductModels->where('company_id', $company_id)->where('status', 1);
            $result = $this->itemsProductModels->first();