api/app/Repository/SalesRepository.php

    public function total_penjualan_hari_ini(string $tanggal_mulai, string $tanggal_selesai, string $company_id)
    {
        try {


            if ($tanggal_mulai != 'TGL.Mulai' && $tanggal_selesai != 'TGL.Selesai') {
                $tanggal_mulai = date("Y-m-d", strtotime($tanggal_mulai));
                $tanggal_selesai = date("Y-m-d", strtotime($tanggal_selesai));

                $this->salesModels->where('sales_date >= ', $tanggal_mulai);
                $this->salesModels->where('sales_date <= ', $tanggal_selesai);
            } else {
                $this->salesModels->where('sales_date', date("Y-m-d"));
            }
            $this->salesModels->select("COALESCE(sum(grand_total),0) AS todays_total_sales");
            $this->salesModels->where('sales_status', 'Final')->where('company_id', $company_id);
            $result = $this->salesModels->first();
---
SELECT COALESCE(sum(grand_total), 0) AS todays_total_sales
FROM `db_sales`
WHERE `sales_date` = '2024-06-29'
AND `sales_status` = 'Final'
AND `company_id` = '4'
 LIMIT 1

    public function jumlah_penjualan_total(string $company_id, string $tanggal_mulai, string $tanggal_selesai)
    {
        try {
            if ($tanggal_mulai != 'TGL.Mulai' && $tanggal_selesai != 'TGL.Selesai') {
                $tanggal_mulai = date("Y-m-d", strtotime($tanggal_mulai));
                $tanggal_selesai = date("Y-m-d", strtotime($tanggal_selesai));
                $this->salesModels->where('sales_date >= ', $tanggal_mulai);
                $this->salesModels->where('sales_date <= ', $tanggal_selesai);

            } else {
                $this->salesModels->where('sales_date', date("Y-m-d"));
            }
            $this->salesModels->select("COALESCE(sum(grand_total),0) AS tot_sal_grand_total");
            $this->salesModels->where('sales_status', 'Final')->where('company_id', $company_id);
            $result = $this->salesModels->first();
---
SELECT COALESCE(sum(grand_total), 0) AS tot_sal_grand_total
FROM `db_sales`
WHERE `sales_date` = '2024-06-29'
AND `sales_status` = 'Final'
AND `company_id` = '4'
 LIMIT 1

    public function total_transaksi_penjualan_hari_ini(string $company_id, string $tanggal_mulai, string $tanggal_selesai)
    {
        try {
            if ($tanggal_mulai != 'TGL.Mulai' && $tanggal_selesai != 'TGL.Selesai') {
                $tanggal_mulai = date("Y-m-d", strtotime($tanggal_mulai));
                $tanggal_selesai = date("Y-m-d", strtotime($tanggal_selesai));
                $this->salesModels->where('sales_date >= ', $tanggal_mulai);
                $this->salesModels->where('sales_date <= ', $tanggal_selesai);
            } else {
                $this->salesModels->where('sales_date', date("Y-m-d"));
            }
            $this->salesModels->select("COALESCE(COUNT(*),0) AS total_transaksi");
            $this->salesModels->where('sales_status', 'Final')->where('company_id', $company_id);
            $result = $this->salesModels->first();
---
SELECT COALESCE(COUNT(*), 0) AS total_transaksi
FROM `db_sales`
WHERE `sales_date` = '2024-06-29'
AND `sales_status` = 'Final'
AND `company_id` = '4'
 LIMIT 1

    public function show_all_riwayat_penjualan(string $company_id, string $tanggal_mulai, string $tanggal_selesai)
    {
        try {
            if ($tanggal_mulai != 'TGL.Mulai' && $tanggal_selesai != 'TGL.Selesai') {
                $tanggal_mulai = date("Y-m-d", strtotime($tanggal_mulai));
                $tanggal_selesai = date("Y-m-d", strtotime($tanggal_selesai));
                $this->salesModels->where('sales_date >= ', $tanggal_mulai);
                $this->salesModels->where('sales_date <= ', $tanggal_selesai);
            }
            $this->salesModels->where('sales_status', 'Final')->where('company_id', $company_id);
            $result = $this->salesModels->findAll();
---
SELECT *
FROM `db_sales`
WHERE `sales_status` = 'Final'
AND `company_id` = '4'