api/app/Models/CompanyModels.php

    public function check_count(string $id)
    {
        try {
            $result = $this->where('id', $id)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `db_company`
WHERE `id` = '4'

    public function find_by_id(string $id)
    {
        try {
            $result = $this->where('id', $id)->first();
---
SELECT *
FROM `db_company`
WHERE `id` = '4'
 LIMIT 1