api/app/Models/UsersAppModels.php

    public function check_count(string $id)
    {
        try {
            $result = $this->where('id', $id)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `user_app`
WHERE `id` = '2'

    public function findById(string $id)
    {
        try {
            $result = $this->where('id', $id)->first();
---
SELECT *
FROM `user_app`
WHERE `id` = '2'
 LIMIT 1